opendj3-server-dev/tests/staf-tests/functional-tests/shared/data/dsml/suites/08miscsuite/data/900_proxyauth_1.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 725
Authorization: Basic %VALIDAUTH%
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
		
        <authRequest principal="cn=pablo picasso + uid=00123456789,ou=search,o=imc,c=us">
        </authRequest>
		
	<modifyRequest dn="cn=paul cezanne,ou=americas,ou=search,o=imc,c=us">
          <modification name="givenname" operation="replace">
               <value>Paul</value>
          </modification>
        </modifyRequest>
	
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
